# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

%matplotlib inline

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
URL = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

baby_names = pd.read_csv(URL, index_col='Id')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1016395 entries, 11350 to 5647426
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Name        1016395 non-null  object
 2   Year        1016395 non-null  int64
 3   Gender      1016395 non-null  object
 4   State       1016395 non-null  object
 5   Count       1016395 non-null  int64
dtypes: int64(3), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [70]:
baby_names.head(10)

           Name  Year Gender State  Count
Id
11350      Emma  2004      F    AK     62
11351   Madison  2004      F    AK     48
11352    Hannah  2004      F    AK     46
11353     Grace  2004      F    AK     44
11354     Emily  2004      F    AK     41
11355   Abigail  2004      F    AK     37
11356    Olivia  2004      F    AK     33
11357  Isabella  2004      F    AK     30
11358    Alyssa  2004      F    AK     29
11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
# Alternative: baby_names.drop(column='Unnamed: 0', inplace=True)
baby_names = baby_names.drop('Unnamed: 0', axis=1)  # Id is the index
baby_names.head()

          Name  Year Gender State  Count
Id
11350     Emma  2004      F    AK     62
11351  Madison  2004      F    AK     48
11352   Hannah  2004      F    AK     46
11353    Grace  2004      F    AK     44
11354    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [5]:
baby_names['Gender'].value_counts(normalize=True)

F    0.549832
M    0.450168
Name: Gender, dtype: float64

### Step 7. Group the dataset by name and assign to names

In [30]:
names = baby_names.groupby('Name')['Count'].sum().sort_values()
names

Name
Destenie         5
Janisha          5
Lizvet           5
Arsalan          5
Janira           5
             ...
Isabella    204798
Ethan       209277
Michael     214405
Emma        214852
Jacob       242874
Name: Count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

In [20]:
print(f"{names.shape[0]:_}")

17_632

### Step 9. What is the name with most occurrences?

In [34]:
print(names.idxmax(), names.max())

Jacob 242874

### Step 10. How many different names have the least occurrences?

In [9]:
(names == names[0]).sum()

2578

### Step 11. What is the median name occurrence?

In [10]:
names[names == names.median()].sort_index()

Name
Aishani    49
Alara      49
Alysse     49
Ameir      49
Anely      49
           ..
Sriram     49
Trinton    49
Vita       49
Yoni       49
Zuleima    49
Name: Count, Length: 66, dtype: int64

### Step 12. What is the standard deviation of names?

In [11]:
names.std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [12]:
names.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64

## Exercises created by me

### 10 most common names for each gender per year.

In [75]:
# Sum the Count column grouped by Year, Gender and Name.

most_common_names_per_year_and_gender = \
    baby_names.groupby(['Year', 'Gender', 'Name'])['Count'].sum() \
    .sort_values(ascending=False)

most_common_names_per_year_and_gender

Year  Gender  Name
2004  M       Jacob        27871
2005  M       Jacob        25814
2004  M       Michael      25438
      F       Emily        25025
2006  M       Jacob        24830
                           ...
2007  F       Brittanny        5
2005  F       Destine          5
2011  F       Maryellen        5
2007  F       Britny           5
2004  F       Aalayah          5
Name: Count, Length: 112288, dtype: int64

In [17]:
# Check the 10 most common names given to men in the year 2011.

ten_most_common_names_per_year_and_gender[
    (ten_most_common_names_per_year_and_gender['Year'] == 2011)
    & (ten_most_common_names_per_year_and_gender['Gender'] == 'M')
]

     Year Gender       Name  Count
150  2011      M      Jacob  20331
151  2011      M      Mason  19488
152  2011      M    William  17314
153  2011      M     Jayden  16954
154  2011      M       Noah  16838
155  2011      M    Michael  16744
156  2011      M      Ethan  16665
157  2011      M  Alexander  15681
158  2011      M      Aiden  15469
159  2011      M     Daniel  15249

In [18]:
# Check the 10 most common names to each sex in the year 2005.

ten_most_common_names_per_year_and_gender[
    ten_most_common_names_per_year_and_gender['Year'] == 2005
]

    Year Gender         Name  Count
20  2005      F        Emily  23928
21  2005      F         Emma  20334
22  2005      F      Madison  19561
23  2005      F      Abigail  15747
24  2005      F       Olivia  15690
25  2005      F     Isabella  15172
26  2005      F       Hannah  14842
27  2005      F     Samantha  13632
28  2005      F          Ava  13603
29  2005      F       Ashley  13270
30  2005      M        Jacob  25814
31  2005      M      Michael  23795
32  2005      M       Joshua  23237
33  2005      M      Matthew  21456
34  2005      M        Ethan  21303
35  2005      M       Andrew  20719
36  2005      M       Daniel  20201
37  2005      M      Anthony  19362
38  2005      M       Joseph  19195
39  2005      M  Christopher  19157

In [19]:
# Check the 3 most common names to each sex in the accumulate
# between 2003 and 2007.

ten_most_common_names_per_year_and_gender[
    (2003 <= ten_most_common_names_per_year_and_gender['Year'])
    & (ten_most_common_names_per_year_and_gender['Year'] <= 2007)
]

    Year Gender         Name  Count
0   2004      F        Emily  25025
1   2004      F         Emma  21599
2   2004      F      Madison  20614
3   2004      F       Olivia  16101
4   2004      F       Hannah  15598
..   ...    ...          ...    ...
75  2007      M  Christopher  19998
76  2007      M      Anthony  19609
77  2007      M      William  18869
78  2007      M      Matthew  18722
79  2007      M       Andrew  18439

[80 rows x 4 columns]